In [1]:
import pandas as pd

In [2]:
df=pd.read_excel("C:/Users/Admin/Desktop/rajesh sir/ISO Country Data in Excel.xlsx")
df

,Country,Two-letter Abbreviation,Country.1,Two-letter Abbreviation.1
0,Afghanistan,AF,Laos,LA
1,Albania,AL,Latvia,LV
2,Algeria,DZ,Lebanon,LB
3,Andorra,AD,Lesotho,LS
4,Angola,AO,Liberia,LR
...,...,...,...,...
89,Kiribati,KI,Ukraine,UA
90,"Korea, Democratic People's Republic",KP,United Arab Emirates,AE
91,"Korea, Republic",KR,United Kingdom,GB
92,Kuwait,KW,United States,US
93,Kyrgyzstan,KG,Uruguay,UY

In [3]:
ISO=df['Country']
ISO

0                             Afghanistan
1                                 Albania
2                                 Algeria
3                                 Andorra
4                                  Angola
                     ...
89                               Kiribati
90    Korea, Democratic People's Republic
91                        Korea, Republic
92                                 Kuwait
93                             Kyrgyzstan
Name: Country, Length: 94, dtype: object

In [4]:
ISO1=df['Country.1']
ISO1

0                     Laos
1                   Latvia
2                  Lebanon
3                  Lesotho
4                  Liberia
              ...
89                 Ukraine
90    United Arab Emirates
91          United Kingdom
92           United States
93                 Uruguay
Name: Country.1, Length: 94, dtype: object

In [5]:
Country_name=pd.concat([ISO,ISO1])
Country_name

0              Afghanistan
1                  Albania
2                  Algeria
3                  Andorra
4                   Angola
              ...
89                 Ukraine
90    United Arab Emirates
91          United Kingdom
92           United States
93                 Uruguay
Length: 188, dtype: object

In [6]:
code=df["Two-letter Abbreviation"]
code

0     AF
1     AL
2     DZ
3     AD
4     AO
      ..
89    KI
90    KP
91    KR
92    KW
93    KG
Name: Two-letter Abbreviation, Length: 94, dtype: object

In [7]:
code1=df["Two-letter Abbreviation.1"]
code1

0     LA
1     LV
2     LB
3     LS
4     LR
      ..
89    UA
90    AE
91    GB
92    US
93    UY
Name: Two-letter Abbreviation.1, Length: 94, dtype: object

In [8]:
ISO_Country_code=pd.concat([code,code1])
ISO_Country_code

0     AF
1     AL
2     DZ
3     AD
4     AO
      ..
89    UA
90    AE
91    GB
92    US
93    UY
Length: 188, dtype: object

In [9]:
country={"ISO_Country_code":ISO_Country_code,"Country_name":Country_name}
Country=pd.DataFrame(country)
Country

   ISO_Country_code          Country_name
0                AF           Afghanistan
1                AL               Albania
2                DZ               Algeria
3                AD               Andorra
4                AO                Angola
..              ...                   ...
89               UA               Ukraine
90               AE  United Arab Emirates
91               GB        United Kingdom
92               US         United States
93               UY               Uruguay

[188 rows x 2 columns]

In [10]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('test_database1')
c = conn.cursor()

c.execute('CREATE TABLE IF NOT EXISTS ISO (ISO_Country_code char(2) NOT NULL PRIMARY KEY, Country_name varchar(30))')
conn.commit()

country={'ISO_Country_code':ISO_Country_code,'Country_name':Country_name}
df=pd.DataFrame(country,columns=['ISO_Country_code','Country_name'])
df.to_sql('ISO', conn, if_exists='replace', index = False)
 
pd.read_sql('SELECT * FROM ISO',con=conn)

    ISO_Country_code          Country_name
0                 AF           Afghanistan
1                 AL               Albania
2                 DZ               Algeria
3                 AD               Andorra
4                 AO                Angola
..               ...                   ...
183               UA               Ukraine
184               AE  United Arab Emirates
185               GB        United Kingdom
186               US         United States
187               UY               Uruguay

[188 rows x 2 columns]